<h1>Основи PHP</h1>
<p>
    PHP додає наступну функціональність до HTML
</p>
<ul>
    <li>Вирази</li>
    <li>Інструкції</li>
    <li>Управління формуванням HTML</li>
</ul>
<p>
    Вирази задаються спеціальними тегами &lt;?= 2 + 3 ?&gt; =
    <?= 2 + 3 ?>
</p>
<p>
    Інструкції - блоки коду, що виконуються без прямого впливу на HTML.
    Є дві форми тегів: повна <?php ?> та скорочена <? ?>
    Повна працює завжди, скорочена - якщо є відповідні налаштування у конфігурації сервера.
    Вживання скороченої форми не рекомендується.
</p>
<p>
    Змінні. Оскільки у PHP процедурна парадигма і простори імен не поширені,
    більшість слів є зарезервовані. Щоб не створювати конфлікти зі змінними,
    всі змінні у PHP починаються зі значка $.
    Типизація динамічна, (на читання - як у JS)
</p>
<p>
<?php
$x=10;
$y="20";
?>
x + y = <?= $x + $y ?>,<br /> 
!!!У PHP розрізнюють оператори арифметичного додавання (+) та рядкової конкатенації ( . )<br />
x . y = <?= $x . $y ?>
</p>
<p>
    Ділення дробове, навіть якщо аргументи цілі x/y = <?= $x/$y ?><br />
    Для одержання цілого значення використовуються функції
    intval(x/y) = <?= intval($x/$y)?>
</p>
<p>
Управління формуванням HTML.<br />
- умовна та циклічна верстка. 
</p>
<?php 
    $arr1 = [1,2,3,4,5]; //звичайний масив
    $arr2 = ['name' => 'Petrovich', "age" => 42 ]; #асоціативний масив
?>
<?php if(count($arr1) >10 ) { ?>
    <h3>У масиві більше за 10 елементів</h3>
    <?php } else { ?>
        <h3>У масиві не більше за 10 елементів</h3>
<?php } ?>
<?php if( isset( $arr2['name'])) : ?>
    <p>Є елемент 'name' = <?=$arr2['name'] ?></p>
    <?php else : ?>
        <p>Єлемент не знайдено </p>
        <?php endif ?>
<p></p>
<?php foreach($arr1 as $element) {?>
    <p><?= $element ?></p>
<?php }?>
<?php foreach($arr2 as $key => $value) : ?>
    <b><?= $key ?>: <?= $value ?></b><br />
<?php endforeach ?>
<?php ?>
<?php ?>
<?php ?>
<?php ?>
<?php ?>
<?php ?>
<?php ?>
<?php ?>
<?php ?>
<p></p>
<p></p>
<p></p>
<p></p>
<p></p>
<p></p>
<p></p>
<p></p>
<p></p>