<h1>Шаблонізація</h1>
<h1></h1>
<p>
    Приведення усіх сторінок сайту до однакового вигляду.
    Досягається (класично) двома підходами
</p>
<ul>
    <li>Відокремлення спільних частин та включення їх до сторінок</li>
    <li>Створення єдиного шаблну в середину якого вставляються тіла сторінок</li>
</ul>
<p>
    Відокремлення сторінок простіше, дозволяє більш гнучко формувати відмінності (на частині сторінок є ліве меню чи рекламний блок, а на інших - немає)
</p>
<p>
    З шаблоном складніше маршрутизація, але зміни централізовані.
    Основна ідея полягає в наступному: всі маршрути ведуть на один шаблон, який аналізує машрут та підбирає тіло.
    Створення єдиної "точки" проходження запитів - це вимога "диспетчера доступу", яка диктується безпекою.
</p>
<p>
    Реалізація - через налашування сервера (Apache).
    Створюємо в корені проєкту файл <code>.htaccess</code>
    У налаштуваннях хосту (vhost) додаємо інструкцію <code>AllowOverride All</code>,
    яка дозволяє приймати додаткові налаштування серверу.
</p>
<p></p>
<p></p>
<p></p>
<p></p>
<ul>
    <li></li>
    <li></li>
    <li></li>
    <li></li>
    <li></li>
    <li></li>
    <li></li>
    <li></li>
</ul>